package org.appcourse.course.ui.utile

import org.appcourse.course.ui.models.CourseEntity


fun mockCoursesList() = listOf(
    CourseEntity(
        100,
        "Java-разработчик с нуля",
        "Освойте backend-разработку и программирование на Java, фреймворки Spring и Maven, работу с базами данных и API. Создайте свой собственный проект, собрав портфолио и став востребованным специалистом для любой IT компании.",
        "999",
        "4.9",
        "2024-05-22",
        false,
        "2024-02-02"
    ),
    CourseEntity(
        101,
        "3D-дженералист",
        "Освой профессию 3D-дженералиста и стань универсальным специалистом, который умеет создавать 3D-модели, текстуры и анимации, а также может строить карьеру в геймдеве, кино, рекламе или дизайне.",
        "12 000",
        "3.9",
        "2024-09-10",
        false,
        "2024-01-20"
    ),
    CourseEntity(
        102,
        "Python Advanced. Для продвинутых",
        "Вы узнаете, как разрабатывать гибкие и высокопроизводительные серверные приложения на языке Kotlin. Преподаватели на вебинарах покажут пример того, как разрабатывается проект маркетплейса: от идеи и постановки задачи – до конечного решения",
        "1 299",
        "4.3",
        "2024-10-12",
        true,
        "2024-08-10"
    ),
    CourseEntity(
        103,
        "Системный аналитик",
        "Освоите навыки системной аналитики с нуля за 9 месяцев. Будет очень много практики на реальных проектах, чтобы вы могли сразу стартовать в IT.",
        "1 199",
        "4.5",
        "2024-04-15",
        false,
        "2024-01-13"
    ),
    CourseEntity(
        104,
        "Аналитик данных",
        "В этом уроке вы узнаете, кто такой аналитик данных и какие задачи он решает. А главное — мы расскажем, чему вы научитесь по завершении программы обучения профессии «Аналитик данных».",
        "899",
        "4.7",
        "2024-06-20",
        false,
        "2024-03-12"
    )
)
